Merge pull request #2 from chris291997/demo
[Feature] Add | liveness first verification
